# Volume Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..Volume Property
Rebar Class See Also
---
The volume of an individual bar multiplied by Quantity.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public double Volume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Volume As Double
	Get
```

Visual C++
---
```text
public:
property double Volume {
	double get ();
}
```

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace